In [ ]:
print("Hello world")

In [ ]:
nums = [1, 2, 3, 4]
print(nums[-2:])

In [1]:
import pandas as pd

In [ ]:
a = pd.Series([1, 2, 3, 4])
print(a)

In [ ]:
vik = [50, 48, 49]
john = [39, 40, 45]

df = pd.DataFrame({"Vikram": vik, "John": john}, index=["maths", "eco", "cs"])

print(df.index) # Returns the indices
print(df.columns) # Returns column names

In [ ]:
df["Vikram"]

## An example of the usage of dataframes to create a table.

In [3]:
stud_names = ["Vikram", "John", "Emma", "David", "Luke"]
sub1 = [40, 39, 47, 30, 31]
sub2 = [43, 32, 49, 21, 25]
sub3 = [44, 37, 44, 32, 14]

test_df = pd.DataFrame({
  "Name": stud_names, 
  "CS": sub1,
  "Math": sub2,
  "Eco": sub3
})

# entire data-frame
print(test_df)
# Get all rows of Math column
# test_df.loc[:, "Math"]
# Get all rows of first 3 coulmns
# test_df.iloc[:, :3]

     Name  CS  Math  Eco
0  Vikram  40    43   44
1    John  39    32   37
2    Emma  47    49   44
3   David  30    21   32
4    Luke  31    25   14